Here is the simplest repo case I could get to:
```
terraform {
  required_providers {
    aiven = {
      source = "aiven/aiven"
    }
  }
}

resource "random_id" "random_postfix" {
  byte_length = 3
}

resource "aiven_account" "account1" {
  name = "test-account-${random_id.random_postfix.hex}"
}

resource "aiven_project" "project" {
  project    = "my-test-project-${random_id.random_postfix.hex}"
  account_id = aiven_account.account1.account_id
}

resource "aiven_account_team" "team" {
  account_id = aiven_account.account1.account_id
  name       = "test-team"
}

resource "aiven_account_team_project" "binding" {
  account_id   = aiven_account.account1.account_id
  team_id      = aiven_account_team.team.team_id
  project_name = aiven_project.project.project
  # team_type    = "developer"
  team_type = "read_only"
}
```

Once you do the first apply, comment out the `read_only` team type and un-comment the `developer` team_type. Re-apply and you should see the issue triggered. 

```
$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aiven_account.account1 will be created
  + resource "aiven_account" "account1" {
      + account_id    = (known after apply)
      + create_time   = (known after apply)
      + id            = (known after apply)
      + name          = (known after apply)
      + owner_team_id = (known after apply)
      + tenant_id     = (known after apply)
      + update_time   = (known after apply)
    }

  # aiven_account_team.team will be created
  + resource "aiven_account_team" "team" {
      + account_id  = (known after apply)
      + create_time = (known after apply)
      + id          = (known after apply)
      + name        = "test-team"
      + team_id     = (known after apply)
      + update_time = (known after apply)
    }

  # aiven_account_team_project.binding will be created
  + resource "aiven_account_team_project" "binding" {
      + account_id   = (known after apply)
      + id           = (known after apply)
      + project_name = (known after apply)
      + team_id      = (known after apply)
      + team_type    = "developer"
    }

  # aiven_project.project will be created
  + resource "aiven_project" "project" {
      + account_id        = (known after apply)
      + available_credits = (known after apply)
      + ca_cert           = (sensitive value)
      + country           = (known after apply)
      + estimated_balance = (known after apply)
      + id                = (known after apply)
      + payment_method    = (known after apply)
      + project           = (known after apply)
    }

  # random_id.random_postfix will be created
  + resource "random_id" "random_postfix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 3
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

random_id.random_postfix: Creating...
random_id.random_postfix: Creation complete after 0s [id=rK61]
aiven_account.account1: Creating...
aiven_account.account1: Creation complete after 2s [id=a31d41f49f79]
aiven_account_team.team: Creating...
aiven_project.project: Creating...
aiven_account_team.team: Creation complete after 0s [id=a31d41f49f79/at31d41fedd55]
aiven_project.project: Creation complete after 1s [id=my-test-project-acaeb5]
aiven_account_team_project.binding: Creating...
aiven_account_team_project.binding: Creation complete after 0s [id=a31d41f49f79/at31d41fedd55/my-test-project-acaeb5]

Apply complete! Resources: 5 added, 0 changed, 0 destroyed.

$ terraform apply
random_id.random_postfix: Refreshing state... [id=rK61]
aiven_account.account1: Refreshing state... [id=a31d41f49f79]
aiven_account_team.team: Refreshing state... [id=a31d41f49f79/at31d41fedd55]
aiven_project.project: Refreshing state... [id=my-test-project-acaeb5]
aiven_account_team_project.binding: Refreshing state... [id=a31d41f49f79/at31d41fedd55/my-test-project-acaeb5]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aiven_account_team_project.binding will be updated in-place
  ~ resource "aiven_account_team_project" "binding" {
        id           = "a31d41f49f79/at31d41fedd55/my-test-project-acaeb5"
      ~ team_type    = "developer" -> "read_only"
        # (3 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aiven_account_team_project.binding: Modifying... [id=a31d41f49f79/at31d41fedd55/my-test-project-acaeb5]

Error: 404: {"errors":[{"message":"Team does not exist","status":404}],"message":"Team does not exist"} - 
```
